function f = int_fun2(u3,v,lamda0,tao,tao1,lamda1,lamda2)
%===========由于z1是由v和一些参数组成的，会导致z1中出现符号量。要保证除了自变量之外的参数都是常数或者向量等
%UNTITLED2 中断概率函数中二重积分的被积函数
%   u3和v是积分变量，z1和tao2是参数            
%   此处显示详细说明
    z1 = 10*log10((10.^((sqrt(2).*lamda0*v+tao)/10)) - (10.^((sqrt(2)*lamda1*u3)/10)))-tao+tao1;
    f = exp(-v.^2).*exp(-u3.^2).*erfc(z1./(sqrt(2).*lamda2));
    %==============关键问题，erfc函数里面必须是实数，而erfc有个对数，
    %===========而对数的真数必须是大于0时，这个对数才是实数，所以
    %=========所以当这个对数里面的数小于0 时，就会出错。
    %====要求v在大范围上要大于u3
end

